perf/load_testing/metar_rate_limiting.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  payload:
    path: "../top-500-airports-worldwide.csv"
    fields:
      - "airport"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 60
      arrivalRate: 10
      rampTo: 100
    - name: Plain
      duration: 30
      arrivalRate: 100
    - name: Clean
      duration: 10
      arrivalRate: 1
scenarios:
  - name: MetAr (/rate-limiter/metar)
    flow:
      - get:
          url: '/rate-limiter/metar'
          qs:
            station: "{{ airport }}"