perf/load_testing/metar_redis.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  payload:
    path: "../top-500-airports-worldwide.csv"
    fields:
      - "airport"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Clean
      duration: 10
      arrivalRate: 1
    - name: Ramp
      duration: 60
      arrivalRate: 1
      rampTo: 300
    - name: Plain
      duration: 60
      arrivalRate: 5

scenarios:
  - name: MetAr Redis (/redis/metar)
    flow:
      - get:
          url: '/redis/metar'
          qs:
            station: "{{ airport }}"