perf/load_testing/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 25
      rampTo: 300
    - name: Plain
      duration: 60
      arrivalRate: 300
    - name: Clean
      duration: 10
      arrivalRate: 1
scenarios:
  - name: Ping (/ping)
    flow:
      - get:
          url: '/ping'