perf/load_testing/space_news_rate_limiting.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 20
      rampTo: 90
    - name: Plain
      duration: 60
      arrivalRate: 90
    - name: Clean
      duration: 10
      arrivalRate: 1

scenarios:
  - name: Space News (/rate-limiter/space_news)
    flow:
      - get:
          url: '/rate-limiter/space_news'